# L_04: Pandas Basics

Pandas is a powerful Python library for data manipulation and analysis.

 Using Upper and lower functions

In [20]:
a = pd.Series(['USB','good','better','best','institute'])
a

0          USB
1         good
2       better
3         best
4    institute
dtype: object

In [ ]:
a.str.upper()

In [ ]:
a.str.lower()

### Basic DataFrame Operations

In [2]:
# Accessing columns
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [3]:
# Summary statistics
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df.describe()

           Score        Age
count   4.000000   4.000000
mean   86.250000  23.500000
std     6.238322   1.290994
min    78.000000  22.000000
25%    83.250000  22.750000
50%    87.500000  23.500000
75%    90.500000  24.250000
max    92.000000  25.000000

In [19]:
# Data types
df.dtypes

NameError: name 'df' is not defined

### Indexing and Selection

In [ ]:
# Select rows by index
df.iloc[1]

In [ ]:
# Conditional selection
df[df['Score'] > 85]

### Modifying DataFrames

In [ ]:
# Adding a new column
df['Grade'] = ['B', 'A', 'A+']
df

In [ ]:
# Dropping a column
df.drop('Passed', axis=1, inplace=True)
df

1. Create DataFrame from list of list

In [ ]:
list1 = [[1,2],[4,5],[6,np.nan],[8,9]]      # NaN(Not A Number) is not zero

df = pd.DataFrame(list1,index = ['apple','orange','mango','banana'],columns = ['box1','box2'])
df

2. Reading DataFrame

In [26]:
list1 = [[1,2],[4,5],[6,np.nan],[8,9]]      # NaN(Not A Number) is not zero
df = pd.DataFrame(list1,index = ['apple','orange','mango','banana'],columns = ['box1','box2'])
df

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, apple to banana
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   box1    4 non-null      int64
 1   box2    3 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 96.0+ bytes

In [ ]:
df.info()

In [ ]:
df.index    # print all index

In [ ]:
df.columns

# L_04: Pandas Basics

Pandas is a powerful Python library for data manipulation and analysis.

Using Upper and lower functions

In [27]:
a = pd.Series(['USB','good','better','best','institute'])
a

0          USB
1         good
2       better
3         best
4    institute
dtype: object

In [28]:
a.str.upper()

0          USB
1         GOOD
2       BETTER
3         BEST
4    INSTITUTE
dtype: object

In [29]:
a.str.lower()

0          usb
1         good
2       better
3         best
4    institute
dtype: object

In [ ]:
Basic DataFrame Operations

In [5]:
# Accessing columns
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [6]:
# Summary statistics
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df.describe()

           Score        Age
count   4.000000   4.000000
mean   86.250000  23.500000
std     6.238322   1.290994
min    78.000000  22.000000
25%    83.250000  22.750000
50%    87.500000  23.500000
75%    90.500000  24.250000
max    92.000000  25.000000

In [7]:
# Data types
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df.dtypes

Name     object
Score     int64
Age       int64
dtype: object

Indexing and Selection

In [8]:
# Select rows by index
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df
df.iloc[1]

Name     Bob
Score     92
Age       25
Name: 1, dtype: object

In [9]:
# Conditional selection
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
}
df = pd.DataFrame(data)
df

df[df['Score'] > 85]

    Name  Score  Age
1    Bob     92   25
3  David     90   24

Modifying DataFrames

In [16]:
# Dropping a column
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [85, 92, 78, 90],
    'Age': [23, 25, 22, 24]
    
}
df = pd.DataFrame(data)
df

df.drop('Score', axis=1, inplace=True)
df

      Name  Age
0    Alice   23
1      Bob   25
2  Charlie   22
3    David   24

Create DataFrame from list of list

In [18]:
import numpy as np
import pandas as pd
list1 = [[1,2],[4,5],[6,np.nan],[8,9]]      # NaN(Not A Number) is not zero

df = pd.DataFrame(list1,index = ['apple','orange','mango','banana'],columns = ['box1','box2'])
df

        box1  box2
apple      1   2.0
orange     4   5.0
mango      6   NaN
banana     8   9.0

Reading DataFrame

In [19]:
list1 = [[1,2],[4,5],[6,np.nan],[8,9]] # NaN(Not A Number) is not zero
df = pd.DataFrame(list1,index = ['apple','orange','mango','banana'],columns = ['box1','box2'])
df

        box1  box2
apple      1   2.0
orange     4   5.0
mango      6   NaN
banana     8   9.0

In [20]:
list1 = [[1,2],[4,5],[6,np.nan],[8,9]] # NaN(Not A Number) is not zero
df = pd.DataFrame(list1,index = ['apple','orange','mango','banana'],columns = ['box1','box2'])
df

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, apple to banana
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   box1    4 non-null      int64
 1   box2    3 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 96.0+ bytes

In [ ]:

df.index    # print all index